## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_management_group.mg_audit will be created
  + resource "azurerm_management_group" "mg_audit" {
      + display_name               = "mg-audit"
      + id                         = (known after apply)
      + name                       = "mg-audit"
      + parent_management_group_id = (known after apply)
      + subscription_ids           = (known after apply)
    }

  # azurerm_management_group.mg_connectivity will be created
  + resource "azurerm_management_group" "mg_connectivity" {
      + display_name               = "mg-connectivity"
      + id                         = (known after apply)
      + name                       = "mg-connectivity"
      + parent_management_group_id = (known after apply)
      + subscription_ids           = (known after apply)
    }

  # azurerm_management_group.mg_corp will be created
  + resource "azurerm_management_group" "mg_corp" {
      + display_name               = "mg-corp"
      + id                         = (known after apply)
      + name                       = "mg-corp"
      + parent_management_group_id = (known after apply)
      + subscription_ids           = (known after apply)
    }

  # azurerm_management_group.mg_decom will be created
  + resource "azurerm_management_group" "mg_decom" {
      + display_name               = "mg-decommissioned"
      + id                         = (known after apply)
      + name                       = "mg-decommissioned"
      + parent_management_group_id = (known after apply)
      + subscription_ids           = (known after apply)
    }

  # azurerm_management_group.mg_hybrid will be created
  + resource "azurerm_management_group" "mg_hybrid" {
      + display_name               = "mg-hybrid"
      + id                         = (known after apply)
      + name                       = "mg-hybrid"
      + parent_management_group_id = (known after apply)
      + subscription_ids           = (known after apply)
    }

  # azurerm_management_group.mg_identity will be created
  + resource "azurerm_management_group" "mg_identity" {
      + display_name               = "mg-identity"
      + id                         = (known after apply)
      + name                       = "mg-identity"
      + parent_management_group_id = (known after apply)
      + subscription_ids           = (known after apply)
    }

  # azurerm_management_group.mg_lzs will be created
  + resource "azurerm_management_group" "mg_lzs" {
      + display_name               = "mg-landing-zones"
      + id                         = (known after apply)
      + name                       = "mg-landing-zones"
      + parent_management_group_id = (known after apply)
      + subscription_ids           = (known after apply)
    }

  # azurerm_management_group.mg_management will be created
  + resource "azurerm_management_group" "mg_management" {
      + display_name               = "mg-management"
      + id                         = (known after apply)
      + name                       = "mg-management"
      + parent_management_group_id = (known after apply)
      + subscription_ids           = (known after apply)
    }

  # azurerm_management_group.mg_online will be created
  + resource "azurerm_management_group" "mg_online" {
      + display_name               = "mg-online"
      + id                         = (known after apply)
      + name                       = "mg-online"
      + parent_management_group_id = (known after apply)
      + subscription_ids           = (known after apply)
    }

  # azurerm_management_group.mg_platform will be created
  + resource "azurerm_management_group" "mg_platform" {
      + display_name               = "mg-platform"
      + id                         = (known after apply)
      + name                       = "mg-platform"
      + parent_management_group_id = (known after apply)
      + subscription_ids           = (known after apply)
    }

  # azurerm_management_group.mg_sandbox will be created
  + resource "azurerm_management_group" "mg_sandbox" {
      + display_name               = "mg-sandbox"
      + id                         = (known after apply)
      + name                       = "mg-sandbox"
      + parent_management_group_id = (known after apply)
      + subscription_ids           = (known after apply)
    }

  # azurerm_management_group.mg_sharedservices will be created
  + resource "azurerm_management_group" "mg_sharedservices" {
      + display_name               = "mg-shared-services"
      + id                         = (known after apply)
      + name                       = "mg-shared-services"
      + parent_management_group_id = (known after apply)
      + subscription_ids           = (known after apply)
    }

  # azurerm_management_group.mg_top will be created
  + resource "azurerm_management_group" "mg_top" {
      + display_name               = "mg-miszel"
      + id                         = (known after apply)
      + name                       = "mg-miszel"
      + parent_management_group_id = (known after apply)
      + subscription_ids           = (known after apply)
    }

Plan: 13 to add, 0 to change, 0 to destroy.
```
</details>